In [17]:
import numpy as np
import pandas as pd

In [18]:
serie = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
serie

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
dataframe = pd.DataFrame({'var1': serie, 'var2': serie})
dataframe

   var1  var2
a     1     1
b     2     2
c     3     3
d     4     4

In [20]:
# Indexación mediante clave del índice en series
serie['a']

np.int64(1)

In [21]:
# Indexación mediante clave del índice en series
dataframe['var2']

a    1
b    2
c    3
d    4
Name: var2, dtype: int64

In [22]:
# Comprobación de la existencia de una clave en el índice en series
'b' in serie

True

In [23]:
# Comprobación de la existencia de un nombre de columna en dataframes
'b' in dataframe

False

In [24]:
# Comprobación de la existencia de un nombre de columna en dataframes
'var1' in dataframe

True

In [25]:
# Adición de elementos a series
serie['e'] = 5
serie

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [26]:
# Adición de elementos a series
dataframe['var3'] = [5, 6, 7, 4]
dataframe

   var1  var2  var3
a     1     1     5
b     2     2     6
c     3     3     7
d     4     4     4

In [27]:
# Eliminación de elementos en series
del serie['e']
serie

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
# Eliminación de columnas en dataframes
del dataframe['var3']
dataframe

   var1  var2
a     1     1
b     2     2
c     3     3
d     4     4

In [29]:
serie = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])
serie

a    1
b    2
c    3
d    4
dtype: int64

In [30]:
dataframe = pd.DataFrame({'var1': pd.Series(serie, dtype= np.int32), 'var2': pd.Series(serie, dtype= object)})
dataframe

   var1 var2
a     1    1
b     2    2
c     3    3
d     4    4

In [31]:
# Consulta del tipo almacenado en una serie
serie.dtype

dtype('int64')

In [32]:
# Consulta de los tipos almacenados en un dataframe
dataframe.dtypes

var1     int32
var2    object
dtype: object

In [33]:
# Consulta del número de dimendiones en una serie
serie.ndim

1

In [34]:
# Consulta del número de dimensiones en un datafram
dataframe.ndim

2

In [35]:
# Consulta de la forma de una serie
serie.shape

(4,)

In [36]:
# Consulta de la forma de un dataframe
dataframe.shape

(4, 2)

In [37]:
# Consulta del número de elementos de una serie
serie.size

4

In [38]:
# Consulta del número de elementos de un dataframe
dataframe.size

8

In [39]:
# Suma de series yy escalar
serie + 2

a    3
b    4
c    5
d    6
dtype: int64

In [40]:
# División de series y escalar
1 / serie

a    1.000000
b    0.500000
c    0.333333
d    0.250000
dtype: float64

In [41]:
# Multiplicación de dataframe y escalar
dataframe * 2

   var1 var2
a     2    2
b     4    4
c     6    6
d     8    8

In [42]:
# División de dataframe y escalar
1 / dataframe

       var1      var2
a  1.000000       1.0
b  0.500000       0.5
c  0.333333  0.333333
d  0.250000      0.25

In [43]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [44]:
dataframe

   var1 var2
a     1    1
b     2    2
c     3    3
d     4    4

In [45]:
serie1 = serie[:]
serie1

a    1
b    2
c    3
d    4
dtype: int64

In [46]:
serie1['e'] = 7
serie1

a    1
b    2
c    3
d    4
e    7
dtype: int64

In [47]:
dataframe1 = dataframe
dataframe1['var3'] = [1, 2, 3, 4]
dataframe1

   var1 var2  var3
a     1    1     1
b     2    2     2
c     3    3     3
d     4    4     4

In [48]:
# Suma de series
serie + serie1

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

In [49]:
# Suma de dataframe
dataframe + dataframe1

   var1 var2  var3
a     2    2     2
b     4    4     4
c     6    6     6
d     8    8     8

In [50]:
# Producto de dataframes
dataframe * dataframe1

   var1 var2  var3
a     1    1     1
b     4    4     4
c     9    9     9
d    16   16    16

In [51]:
dataframe

   var1 var2  var3
a     1    1     1
b     2    2     2
c     3    3     3
d     4    4     4

In [52]:
dataframe.T

      a  b  c  d
var1  1  2  3  4
var2  1  2  3  4
var3  1  2  3  4

In [53]:
# Operciones sobre series
np.sqrt(serie)

a    1.000000
b    1.414214
c    1.732051
d    2.000000
dtype: float64

In [54]:
dataframe

   var1 var2  var3
a     1    1     1
b     2    2     2
c     3    3     3
d     4    4     4

In [55]:
# Operaciones sobre dataframes (columna, por defeto)
np.sum(dataframe)

c:\Users\ASUS\AppData\Local\Programs\Python\Python312\Lib\site-packages\numpy\_core\fromnumeric.py:84: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)

var1    10
var2    10
var3    10
dtype: object

In [56]:
# Operaciones sobre dataframes (especificando eje)
np.sum(dataframe, axis=1)

a     3
b     6
c     9
d    12
dtype: object